[
    {
        "question": "You’re on a first date. What’s the first thing you ask a potential partner?",
        "ans": [
            "If I’m beautiful.",
            "Nothing. I let them ask the questions.",
            "If they want to go on a wild adventure with me.",
            "What they want and need in a relationship."
        ]
    },
    {
        "question": "You just had the worst nightmare ever. What do you do?",
        "ans": [
            "Reach for my partner. I need to tell them everything.",
            "See if my partner is up. If they’re not, I’ll go back to sleep.",
            "Write it down in my journal. I’ll tell my partner about it later.",
            "Make sure my partner is sleeping. Hopefully they didn’t hear me scream."
        ]
    },
    {
        "question": "You’re asked to go on a double date. How do you respond?",
        "ans": [
            "Give them a big fat “NO!” My partner is for me and me only.",
            "Smile nervously. If that’s what they think is best, sure.",
            "With a “Let’s do it!” It sounds like a super fun idea!",
            "Shrug and go along with it. Maybe it’ll bring us closer as a couple."
        ]
    },
    {
        "question": "Let’s say your partner doesn’t like your favorite artist. How do you react?",
        "ans": [
            "I shove them. Their taste in music is truly outrageous.",
            "Say it’s okay and move on. I don’t want to start an argument.",
            "Roll my eyes. They can’t control my music taste.",
            "Ask them why. What made them not like this beautiful music?"
        ]
    },
    {
        "question": "Your friend sets you up on a blind date. What do you do?",
        "ans": [
            "Ask if the blind date knows who I am. Have they seen my Insta?",
            "Nod and go along with the plan. I trust them.",
            "Hug them. What a sweet and spontaneous thing for them to do!",
            "Shake my head. That sounds like a murder waiting to happen."
        ]
    },
    {
        "question": "Let’s pretend your partner pops the big question publicly. What do you do?",
        "ans": [
            "Say “yes,” of course! We even have an audience!",
            "Run and hide. All these people are staring at me!",
            "Freeze. Am I ready to settle down and get married?",
            "Check to ensure they’re of sound mind. I can only say “yes” if they’re serious."
        ]
    },
    {
        "question": "What do you usually do when you and your partner argue?",
        "ans": [
            "Say they’re “right” so they’ll do nice things for me.",
            "Agree with whatever they say. I don’t like confrontation.",
            "Tell them exactly how I feel. There’s no point in secrets.",
            "Accuse them of being in the wrong. I’m always right."
        ]
    },
    {
        "question": "Your partner is arguing with their BFF. What do you do?",
        "ans": [
            "Call them up and find a way to make it about me.",
            "Ask them if there’s anything I can do to help them make amends.",
            "Tell them to make up. You only live once, so why live with regrets?",
            "Step in. I need to protect my partner no matter what."
        ]
    },
    {
        "question": "Your partner cancels your date last minute. How do you react?",
        "ans": [
            "Say it’s fine, as long as they take me wherever I want to go next.",
            "Fake a smile. I’m sure something important came up.",
            "Shrug it off. I’ll find something even more fun to do instead.",
            "With a disappointed shake of my head. They know what that means."
        ]
    },
    {
        "question": "You and your partner just went on a trip. What do you do when you get home?",
        "ans": [
            "Go through trip pictures. They better tell me I look amazing.",
            "Ask what they want to do first. I’ll do whatever I can to make them happy.",
            "Book the next one ASAP. I live for adventure!",
            "Go grocery shopping. My partner needs yogurt and milk."
        ]
    },
    {
        "question": "You’ve had a rough day. What would you like to do?",
        "ans": [
            "Snuggle with my partner. They give the best hugs (and compliments).",
            "Call my mom or best friend and tell them how I’m feeling.",
            "Leave the house. I don’t care where I go. I’ll just see where I end up.",
            "Take a bubble bath. Sometimes I even need to unwind."
        ]
    },
    {
        "question": "You show up to a date to find your partner invited friends. How do you feel?",
        "ans": [
            "Embarrassed. I definitely wore the wrong outfit.",
            "Surprised. It wasn’t my idea, but I’ll go along with it.",
            "Excited. What an unexpected but delightful surprise!",
            "Angry. This was supposed to be a one-on-one date."
        ]
    }
]