[
    {
        "question": "If my partner did this, I would be thrilled:",
        "ans": [
            "Showed up at my house with snacks and a map. Road trip time!",
            "Cleaned the whole house as a surprise—acts of service are key.",
            "Gave me my space when I asked for it. Independence is so important.",
            "Listened to me vent about my problems. Everybody needs a shoulder to cry on!"
        ]
    },
    {
        "question": "Picture this: you’re living your best life. What does it look like?",
        "ans": [
            "I travel to new places every week and am surrounded by adventure.",
            "I’m crushing it in my career, committed to an awesome partner, and live in a penthouse apartment.",
            "Mystery makes life exciting. I take things one day at a time!",
            "I feel connected to a loving partner, and I get to be creative every day."
        ]
    },
    {
        "question": "Someone just made your heart flutter. What did you notice about them first?",
        "ans": [
            "Their smile. It’s completely infectious!",
            "The way they present themselves. They look so put together and confident.",
            "Their individuality. They’ve got a unique sense of style and fascinating ideas.",
            "Their gaze. When we lock eyes, I feel like they really see me, you know?"
        ]
    },
    {
        "question": "Three perfect words describe your soulmate. They are:",
        "ans": [
            "Cheerful, intuitive, and grounded.",
            "Spontaneous, outgoing, innovative.",
            "Courageous, diligent, warm.",
            "Practical, harmonious, determined."
        ]
    },
    {
        "question": "What’s your biggest pet peeve in a relationship?",
        "ans": [
            "When someone can’t slow down and appreciate the little things.",
            "When someone gives up too easily.",
            "When someone doesn’t respect my boundaries.",
            "When someone refuses to understand my point of view."
        ]
    },
    {
        "question": "What’s your dream first date?",
        "ans": [
            "An evening of stargazing.",
            "A night at a music festival.",
            "An afternoon competing at the arcade.",
            "A home-cooked meal followed by a scavenger hunt."
        ]
    },
    {
        "question": "What’s your dating red flag?",
        "ans": [
            "People say I’m not serious enough. But why be serious when you can be fun?",
            "I have a tough time going with the flow. But you can always trust me to handle the planning.",
            "I’ve been called “flighty” in the past. But I’ve always felt that I’m just independent.",
            "I’ve been known to get a little too emotional. But I can’t help that I care!"
        ]
    },
    {
        "question": "How do you hope your partner influences you and your life?",
        "ans": [
            "They add a little more romance to my day.",
            "They ignite a spark of passion and adventure within me.",
            "They offer me unconditional support.",
            "They never let me give up on myself."
        ]
    },
    {
        "question": "You and your partner jet off for a romantic getaway—what’s on the schedule?",
        "ans": [
            "Nonstop adventure. Dancing, zip lining, hiking—we’re thrill seekers.",
            "Every hour is planned. Scheduling is the key to successful vacations!",
            "We’re all about culture. We'll get to know the ins and outs of a foreign city.",
            "A relaxing pace. Long talks, couples massages, and romantic dinners."
        ]
    },
    {
        "question": "What are your simple pleasures in life?",
        "ans": [
            "A gorgeous sunset.",
            "Finally completing a long project.",
            "A great book.",
            "An amazing conversation."
        ]
    },
    {
        "question": "You’re traveling the world with an animal sidekick. What animal do you take?",
        "ans": [
            "Golden retriever.",
            "Husky.",
            "Cat.",
            "Bunny."
        ]
    },
    {
        "question": "What’s your dream gift?",
        "ans": [
            "An exciting experience—a skydiving class for one? That’s perfect!",
            "Something handmade. Show me you care through hard work, and I’ll be happy.",
            "Something unique. Skip the boring flowers and chocolate.",
            "Something personal. Buy me my favorite candy or write me a sweet poem."
        ]
    }
]