[
    {
        "question": "In your heart of hearts, you’re:",
        "ans": [
            "An explorer. I love adventure.",
            "A doer. I like staying busy.",
            "A thinker. I usually take the logical route.",
            "A feeler. I’m typically the emotional one of the group."
        ]
    },
    {
        "question": "Deep down, what would you say is your biggest flaw?",
        "ans": [
            "Selfishness. I tend to put my needs first.",
            "Perfectionism. I hate disappointing people.",
            "Indecisiveness. I tend to get stuck in my own head.",
            "Sensitivity. I feel emotions deeply."
        ]
    },
    {
        "question": "In relationships, you:",
        "ans": [
            "Love to be flirty. I’m extremely passionate.",
            "Take it slow. I want to make sure I’m physically and mentally attracted first.",
            "Talk a lot. What? I enjoy stimulating conversations.",
            "Fall hard fast. I get attached pretty quickly."
        ]
    },
    {
        "question": "How are you with money?",
        "ans": [
            "I spend what I want, when I want. End of story.",
            "I tend to splurge every now and then, but I do have a budget.",
            "I save a lot, just so I can take my loved ones on fun experiences.",
            "I tend to shop when I’m sad. My savings don’t last long."
        ]
    },
    {
        "question": "It’s finally the weekend! What’s on your to-do list?",
        "ans": [
            "Go to a party. It’s time to have fun and get wild!",
            "Text my crush. What? I’m feeling hot.",
            "Go to the museum or library. Maybe I’ll bring some friends with me.",
            "Sleep in! My weekends are all about relaxing."
        ]
    },
    {
        "question": "If your friends knew you inside and out, how would they describe you?",
        "ans": [
            "Bold, confident, and determined.",
            "Creative, generous, and ambitious.",
            "Adventurous, honest, and fair.",
            "Talkative, adaptable, and smart."
        ]
    },
    {
        "question": "What’s your deepest passion?",
        "ans": [
            "Competition. That’s what life’s all about!",
            "Myself, duh.",
            "World exploration. There’s so much to see!",
            "Art and literature. I have big feelings and love giving them space to breathe."
        ]
    },
    {
        "question": "If you were a superhero, what would your superpower be?",
        "ans": [
            "To control nature. I’d love to create beautiful scenes around me.",
            "Mind reading. It’d be cool to know what people are thinking.",
            "Telekinesis. I could control anything anywhere at any time.",
            "To fly. I’d be able to see the world and more!"
        ]
    },
    {
        "question": "Your crush sits next to you. What would you ideally do?",
        "ans": [
            "Scooch closure. Oops! Maybe I’ll “accidentally” touch their arm.",
            "Smile and ask if they need anything. I’ll do anything for them.",
            "Wink and flirt. Yep, I’m that confident.",
            "Strike up a friendly chat. I’m an excellent conversationalist."
        ]
    },
    {
        "question": "Growing up, you wanted to be a:",
        "ans": [
            "A beauty guru. I’ve always enjoyed the finer things in life.",
            "A doctor. I’ve always dreamed of helping people.",
            "A queen/king. I’ve always wanted to rule the world.",
            "An artist. I’ve always wanted to express my feelings and create beauty."
        ]
    },
    {
        "question": "If you could wish for anything in the world, what would you wish for?",
        "ans": [
            "An at-home theater. I’m a homebody, and I’m not afraid to admit it!",
            "A magic ball that could tell me who to trust. You can never be too sure.",
            "A fully stocked art studio. I’d be able to create anything and everything.",
            "Power. Yeah, I’m one of those people."
        ]
    },
    {
        "question": "Which of these pets would you like to have?",
        "ans": [
            "A hermit crab",
            "A scorpion or spider",
            "A betta fish",
            "A horse or goat"
        ]
    },
    {
        "question": "What’s the first thing you like to do after a long day?",
        "ans": [
            "Pour myself a cup of tea and watch a movie.",
            "Journal and let out all the emotions I’ve been hiding.",
            "Color in a coloring book while listening to music.",
            "Call a loved one and tell them all about it."
        ]
    },
    {
        "question": "Which deep struggle do you relate to most?",
        "ans": [
            "Honestly, I’m terrified of being alone.",
            "Sometimes, I don’t tell the truth just to avoid conflict.",
            "I sometimes really struggle to share my emotions with people.",
            "I’m really afraid of commitment, and sometimes it hurts my relationships."
        ]
    },
    {
        "question": "What compliment would you most like to receive?",
        "ans": [
            "“Wow, I love how friendly and charming you are!”",
            "“You’re gorgeous, and you have amazing style.”",
            "“You’re so authentic. You really march to the beat of your own drum.”",
            "“I can’t believe how pulled together you are. You really have it all figured out.”"
        ]
    },
    {
        "question": "When it comes to making decisions, you’re usually:",
        "ans": [
            "Debating possibilities. I like to try to see both sides before I make a choice.",
            "Totally indecisive. I really struggle with making decisions.",
            "Thinking far ahead. I’m always planning for the future.",
            "Following my heart. My emotions get the best of me."
        ]
    }
]